In [4]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import matplotlib.ticker as ticker
import seaborn as sns
import plotly.express as px
# import theme

%matplotlib inline

In [5]:
gdp = pd.read_csv('gdp.csv')
employement_stats = pd.read_csv('emp.csv')

In [3]:
df.head() #.to_dict('record')

NameError: name 'df' is not defined

In [39]:
employement_stats.head()

   year  total   male  female
0  1998  25.00  21.32   29.96
1  1999  25.37  21.06   30.26
2  2000  29.88  25.33   35.66
3  2001  30.69  26.33   36.41
4  2002  33.29  27.31   41.32

In [40]:
def gdp():
    df = pd.read_csv('gdp.csv')
    return df #.to_dict('record')

In [41]:
gdp().head()

   year       gdp
0  1961  3.844751
1  1962  6.177883
2  1963  7.373613
3  1964  7.939782
4  1965  6.122761

In [42]:
def unemployement_stats():
    df = pd.read_csv('emp.csv')
    return df

In [43]:
unemployement_stats().head()

   year  total   male  female
0  1998  25.00  21.32   29.96
1  1999  25.37  21.06   30.26
2  2000  29.88  25.33   35.66
3  2001  30.69  26.33   36.41
4  2002  33.29  27.31   41.32

In [52]:
def male_unemployment_rate():
    male = pd.read_csv('emp.csv')
    df = male[['year', 'male']]
    return df #.to_dict('record')

In [53]:
male_unemployment_rate().head()

   year   male
0  1998  21.32
1  1999  21.06
2  2000  25.33
3  2001  26.33
4  2002  27.31

In [56]:
def female_unemployment_rate():
    female = pd.read_csv('emp.csv')
    df = female[['year', 'female']]
    return df #.to_dict('record')

In [57]:
female_unemployment_rate().head()

   year  female
0  1998   29.96
1  1999   30.26
2  2000   35.66
3  2001   36.41
4  2002   41.32

In [60]:
def total_employment_rate():
    df = pd.read_csv('emp.csv')
    df = df[['year', 'total']]
    return df #.to_dict('record')

In [61]:
total_employment_rate().head()

   year  total
0  1998  25.00
1  1999  25.37
2  2000  29.88
3  2001  30.69
4  2002  33.29